{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Metadata describing implemented features, involved files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing human‑written summaries for various frontend files.",
  "frontend/index.css": "Tailwind base styles defining light/dark CSS variables and global background/text behavior.",
  "frontend/index.html": "HTML entry point with root div and script loading the React app.",
  "frontend/src/App.tsx": "Defines the TanStack Router setup and routes for the main app pages.",
  "frontend/src/components.json": "shadcn-ui config mapping component aliases and Tailwind settings.",
  "frontend/src/components/AppHeader.tsx": "Header with back navigation, theme toggle, app title, and saved-questions button.",
  "frontend/src/components/AppLayout.tsx": "Root layout applying theme initialization, header, routed content, footer, and toasts.",
  "frontend/src/components/BookCard.tsx": "Clickable book card component with icon, title, description, and metadata counts.",
  "frontend/src/components/HintsPanel.tsx": "Interactive hints panel allowing showing, hiding, or revealing hints progressively.",
  "frontend/src/components/ProseContent.tsx": "Renders HTML content with prose-styled typography and dark-mode support.",
  "frontend/src/components/QuestionActions.tsx": "Buttons for marking questions complete or saving them, with tooltips and state hooks.",
  "frontend/src/components/QuestionSections.tsx": "Renders collapsible sections for a topic’s video, hints, and solution with UI controls and state toggles.",
  "frontend/src/components/SavedQuestionRow.tsx": "Displays a saved question row with metadata and actions to open or remove it.",
  "frontend/src/components/ThemeToggle.tsx": "Button component that toggles between light and dark themes using useTheme.",
  "frontend/src/components/TopicRow.tsx": "Renders an interactive topic row showing completion state and clickability.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useCompletedTopics.ts": "Manages completed topic IDs in local storage with a toggle function and toast notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating no backend queries exist.",
  "frontend/src/hooks/useSavedQuestions.ts": "Stores saved question IDs in local storage with functions to toggle or remove items and toast feedback.",
  "frontend/src/hooks/useTheme.ts": "Manages theme state synced to local storage and applies light/dark mode classes.",
  "frontend/src/index.css": "Tailwind base and custom styles defining light/dark themes, typography, utilities, and scrollbar styling.",
  "frontend/src/lib/data.ts": "Defines TypeScript interfaces for books, sections, and topics, and provides the static content data used throughout the app.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes the React app root, sets up React Query and Internet Identity provider, and renders the App component.",
  "frontend/src/pages/BooksPage.tsx": "Renders the book selection view, displaying available books as animated cards with navigation on click.",
  "frontend/src/pages/QuestionDetailPage.tsx": "Displays an individual question with metadata, content, navigation between topics, and related actions.",
  "frontend/src/pages/SavedQuestionsPage.tsx": "Shows the user's saved questions, resolving topic metadata and providing navigation to each question.",
  "frontend/src/pages/TopicsPage.tsx": "Lists all sections and topics for a book with progress tracking and navigation into individual question pages.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins for the project.",
  "project_state.json": "Stores project metadata, feature requirements, and known issues for the Swift Interview Prep app."
}