{
  "backend/main.mo": "Minimal Motoko actor with no methods or state.",
  "feature_evidence.json": "Feature evidence describing a color‑theme update from purple/blue to green, listing affected files and metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files.",
  "frontend/index.css": "Global Tailwind CSS setup defining light/dark CSS variables using a green‑based theme.",
  "frontend/index.html": "Static HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router with routes for books, topics, questions, and saved items, wrapped in AppLayout.",
  "frontend/src/components.json": "shadcn-ui configuration defining styling, paths, and Tailwind integration.",
  "frontend/src/components/AppHeader.tsx": "Header with contextual back navigation, theme toggle, and saved-questions button with badge.",
  "frontend/src/components/AppLayout.tsx": "Page layout with header, footer, theme initialization, and a routed content outlet.",
  "frontend/src/components/BookCard.tsx": "Clickable book card component with styled icon, animations, and book metadata display.",
  "frontend/src/components/HintsPanel.tsx": "Expandable hints panel allowing showing, hiding, or revealing all hints with animated entries.",
  "frontend/src/components/ProseContent.tsx": "Renders HTML prose and injects copy-to-clipboard buttons into code blocks with toast feedback.",
  "frontend/src/components/QuestionActions.tsx": "Provides buttons to mark a topic as completed or saved, using local-storage-backed hooks and tooltips.",
  "frontend/src/components/QuestionSections.tsx": "Renders collapsible sections for video, hints, and solution content of a topic.",
  "frontend/src/components/SavedQuestionRow.tsx": "Displays a saved question row with metadata and a remove button, triggering navigation on click.",
  "frontend/src/components/ThemeToggle.tsx": "Light/dark mode toggle button driven by the theme hook.",
  "frontend/src/components/TopicRow.tsx": "Shows a topic entry with completion and accessibility states, supporting navigation when clickable.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching queries when identity changes.",
  "frontend/src/hooks/useCompletedTopics.ts": "Tracks completed topic IDs in local storage and provides a toggle with toast notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity login/logout state management and context using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating no backend queries exist.",
  "frontend/src/hooks/useSavedQuestions.ts": "Manages saved question IDs in local storage with functions to toggle or remove them and show toasts.",
  "frontend/src/hooks/useTheme.ts": "Handles theme initialization, persistence, and toggling between light and dark modes.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for light/dark themes, typography utilities, animations, and custom scrollbar styles.",
  "frontend/src/lib/data.ts": "Defines TypeScript interfaces for books, sections, and topics and provides the full dataset for Swift interview challenges.",
  "frontend/src/lib/utils.ts": "Exports a utility function combining class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers and loads global styles.",
  "frontend/src/pages/BooksPage.tsx": "Displays all available books as animated cards and navigates to selected book pages.",
  "frontend/src/pages/QuestionDetailPage.tsx": "Shows a question's details, content, navigation controls, and related sections for a chosen topic.",
  "frontend/src/pages/SavedQuestionsPage.tsx": "Lists user-saved questions or an empty state, with navigation back to each question's detail page.",
  "frontend/src/pages/TopicsPage.tsx": "Displays all sections and topics of a book with progress tracking and navigation to each topic.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions including colors, radii, shadows, animations, and plugin integration.",
  "project_state.json": "Defines the project’s state, features, and known UI issues for the Swift Interview Prep app. Includes versioning, improvement goals, and a noted hints display bug."
}