{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Metadata describing implemented features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing high‑level descriptions of all frontend components and pages.",
  "frontend/index.css": "Tailwind base/style layers defining CSS variables for light/dark themes and global styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for books, topics, questions, and saved questions.",
  "frontend/src/components.json": "Shadcn UI config defining paths, Tailwind settings, and component aliases.",
  "frontend/src/components/AppHeader.tsx": "Header with back navigation, title, and saved‑questions button with counter.",
  "frontend/src/components/AppLayout.tsx": "Root layout wrapping pages with header, footer, and toast provider.",
  "frontend/src/components/BookCard.tsx": "Clickable styled card displaying book metadata and navigation affordances.",
  "frontend/src/components/HintsPanel.tsx": "Expandable hint viewer supporting incremental reveal, show-all, and hide-all controls.",
  "frontend/src/components/ProseContent.tsx": "Component rendering HTML content with styled prose formatting.",
  "frontend/src/components/QuestionActions.tsx": "Buttons for marking a question complete or saved with tooltips and state handling.",
  "frontend/src/components/QuestionSections.tsx": "Renders collapsible sections for a topic's video, hints, and solution with UI buttons and state toggles.",
  "frontend/src/components/SavedQuestionRow.tsx": "Shows a saved question row with metadata and a remove button, using local saved-questions state.",
  "frontend/src/components/TopicRow.tsx": "Displays a topic row with completion and clickability states, showing different icons and styling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCompletedTopics.ts": "Manages completed topic IDs in localStorage with toggling and toast notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login handling, identity loading, and provider utilities.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend query methods exist.",
  "frontend/src/hooks/useSavedQuestions.ts": "Handles saving and removing question IDs in localStorage with toast feedback.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode colors, focus states, utilities, and custom scrollbars.",
  "frontend/src/lib/data.ts": "Defines data structures for books, sections, and topics and exports a sample book dataset.",
  "frontend/src/lib/utils.ts": "Exports a utility function merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/BooksPage.tsx": "Renders the books grid with animated book cards and navigation to each book's topics.",
  "frontend/src/pages/QuestionDetailPage.tsx": "Displays a question’s details, content, and navigation between questions with actions and section components.",
  "frontend/src/pages/SavedQuestionsPage.tsx": "Shows saved questions by resolving topic metadata and linking back to their respective question detail pages.",
  "frontend/src/pages/TopicsPage.tsx": "Lists a book’s sections and topics with progress indicators and navigation to individual question pages.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins for the project’s design system.",
  "project_state.json": "Defines the project state, known issues, features, and UX improvement requirements for the interview prep app."
}