{
  "kind": "build_request",
  "title": "Switch site color palette from purple to green (light + dark themes)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Update the app’s design tokens so the overall brand/primary color theme changes from the current purple/blue palette to a green-based palette across both light and dark mode. This includes updating the CSS variables in `frontend/src/index.css` (e.g., `--primary`, `--ring`, and any other theme tokens currently using purple/blue hues such as chart colors and accents as appropriate), and adjusting any utility classes that hardcode blue/purple colors (e.g., the `.gradient-text` utility currently using `to-blue-600`) so the UI no longer presents as purple/blue and instead reads as green-themed while maintaining good contrast and readability.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "currently we are using purple like color (i think i named it correct but not sure) but i want green color theme for my website"
        ]
      },
      "acceptanceCriteria": [
        "In light mode, primary actions and accents (e.g., buttons, icons using `text-primary`, focus rings using `ring-ring`) appear green-toned rather than purple/blue.",
        "In dark mode, the primary color and focus ring are also green-toned and remain clearly visible on dark backgrounds.",
        "The `.gradient-text` utility no longer gradients to a blue color (e.g., no longer uses `to-blue-600`) and instead uses a green-compatible gradient end color.",
        "No obvious purple/blue brand accents remain in common UI surfaces (header icon background, primary buttons, links/accents, focus styles) unless intentionally kept for non-brand semantic purposes (e.g., destructive/red).",
        "Typography and contrast remain readable in both themes (no low-contrast green text on green backgrounds)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (read-only UI component sources); achieve the theme change via tokens/CSS variables and composition elsewhere.",
    "Keep the existing light/dark mode mechanism (Tailwind class-based `dark` mode and theme persistence) intact; only change the palette values and any hardcoded accent utility colors that conflict with the new green theme."
  ],
  "nonGoals": [
    "Do not redesign layouts, navigation structure, or add new pages/features.",
    "Do not change authentication or backend behavior (backend remains unchanged).",
    "Do not change the light/dark theme toggle behavior or persistence—only the color palette."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Prefer a green color theme instead of purple for the website branding/accent colors."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}