{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Light/Dark Mode Theme Toggle",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Enable app-wide Tailwind class-based dark mode by toggling the `dark` class on the document root, using existing theme CSS variables.",
      "acceptanceCriteria": [
        "When dark mode is enabled, the `dark` class is applied to `document.documentElement` and dark theme tokens take effect across all pages (Books, Topics, Question Detail, Saved Questions).",
        "When dark mode is disabled, the `dark` class is not present and light theme tokens take effect across all pages.",
        "No backend changes are required for theme switching."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useTheme.ts",
          "operation": "create",
          "description": "Create a theme manager hook (and/or context) that applies/removes the `dark` class on `document.documentElement` and exposes current theme + a setter for use across the app. Ensure it uses Tailwind's class-based dark mode and relies on existing CSS variables in frontend/src/index.css."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Wire the theme manager into the app shell so it runs app-wide (all routed pages) without modifying immutable entry files; ensure the document root class is updated when the theme changes."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Add an accessible Light/Dark theme toggle control to the persistent header without breaking existing navigation and saved state UI.",
      "acceptanceCriteria": [
        "The header includes a clearly discoverable toggle button that switches theme immediately on click/tap.",
        "The toggle is keyboard accessible and includes an appropriate English `aria-label` that reflects the action/state (e.g., \"Switch to dark mode\" / \"Switch to light mode\").",
        "The toggle does not break existing header behavior (back navigation, Saved button, saved count badge)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ThemeToggle.tsx",
          "operation": "create",
          "description": "Add a reusable ThemeToggle control that uses the shared theme hook/context to switch between Light and Dark. Use shadcn-ui Button styling for consistency and ensure accessible labeling + keyboard operability. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppHeader.tsx",
          "operation": "modify",
          "description": "Add the ThemeToggle control into the persistent header UI (alongside existing back navigation and Saved button) and ensure the aria-label text is in English and reflects the current state/action. Keep existing header behavior intact. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Persist the selected theme in localStorage, initialize on app load, and default to system color scheme when no preference is saved.",
      "acceptanceCriteria": [
        "After selecting a theme, refreshing the page preserves the chosen theme.",
        "On a fresh browser (no saved preference), the app theme matches the system color scheme.",
        "Implementation does not require editing any files listed as immutable in SYSTEM_CONTEXT (notably `frontend/src/main.tsx` and Internet Identity hooks)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useTheme.ts",
          "operation": "modify",
          "description": "Add localStorage persistence for the theme preference and initialization logic: on first load, if no stored preference exists, choose the initial theme from `prefers-color-scheme`; otherwise apply the stored theme. Ensure updates write to localStorage and immediately update the `dark` class on `document.documentElement`."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Ensure the theme initialization runs on app load via the layout (not via immutable frontend/src/main.tsx), so refreshes preserve the saved theme and first-time users default to system preference across all pages."
        }
      ]
    }
  ]
}